const FOOD_DATA = [
  {
    "name":"Інструктор",
    "brand":"Микола",
    "price":"Стаж: 15 років",
  },
  {
    "name":"Інструктор",
    "brand":"Микола",
    "price":"Стаж: 15 років",

  },
  {
    "name":"Інструктор",
    "brand":"Микола",
    "price":"Стаж: 15 років",

  },
  {
    "name":"Інструктор",
    "brand":"Микола",
    "price":"Стаж: 15 років",

  },
  {
    "name":"Інструктор",
    "brand":"Микола",
    "price":"Стаж: 15 років",

  },
  {
    "name":"Інструктор",
    "brand":"Микола",
    "price":"Стаж: 15 років",

  },
  {
    "name":"Інструктор",
    "brand":"Микола",
    "price":"Стаж: 15 років",

  },
  {
    "name":"Інструктор",
    "brand":"Микола",
    "price":"Стаж: 15 років",

  },
  {
    "name":"Інструктор",
    "brand":"Микола",
    "price":"Стаж: 15 років",

  }
];